<!DOCTYPE html>
<html lang="en">
<head>
    <link rel="stylesheet" href="all.css">
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Ma-technology  </title>
</head>
<body>

    <h1>Uutiset</h1>

<header>
    <div class="main">
        <ul>
            <li><a href="Index2.html">Uutiset</a></li>
            <li><a href="Index3.html">Tietoa</a></li>
            <li><a href="Index.html">Kotisivu</a></li>
            <li><a href="Index4.html">Kauppa</a></li>
        </ul>
    </div>
</header>

<br>
<center>
    <h1>Samsung Note20 -sarja julkaisu.</h1>
    <h6>Kirjoittanut: Alex Ruuska 6.8.2020 klo 14:02. <br> Aihe: Puhelimet.</h6>
</center>
<br>
<center>
<li><a href="Note20 -sarja Tekniset.html">Katso tekniset tiedot täältä!</a></li>
</center>

<center>
<p>Note20 &nbsp;-sarja</p>
<p>Samsung julkaisi heid&auml;n Unpacked -tapahtumassa heid&auml;n uusia laitteitansa. 
    (Note20 -sarjan, Galaxy Watch 3, Tab 7, Z Fold 2 sek&auml; Galaxy Buds Liven. T&auml;ss&auml;
     Artikkelissa perehdyt&auml;&auml;n Note20 sarjaan. Ylh&auml;&auml;lt&auml; voit katsoa molempien puhelimien tekniset tiedot,
      jos et niit&auml; viel&auml; ole n&auml;hnyt!</p>
<p>&nbsp;</p>
<p>Note20</p>
<p>Note20 -sarjan n&auml;yt&ouml;t eroavat resoluutiossa, virkistystaajuudessa ja kaarevuudessa. 
    Note20:n n&auml;ytt&ouml; on Vaan Full HD+ -resoluutiolla ja vaan 60Hz virkistystaajuudella, 
    vaikka puhelin maksaa yli tonnin. Kalliimman Note20 Ultran n&auml;yt&ouml;n resoluutio WQHD+ 
    ja virkistystaajuudeltaan nykyaikaisempi 120 hertsi&auml; ja kaareva. 
    Molemmissa l&ouml;ytyy AMOLED n&auml;ytt&ouml; mitk&auml; ovat yleens&auml; Samsungilla hyvi&auml;.</p>
    <br>
<p>Materiaalit ovat puhelimissa erilaiset. Molemmissa puhelimissa runko on metallia, 
    mutta vaan Note20 Ultra k&auml;ytt&auml;&auml; takana uutta Gorilla Glass 7,
     kun Note20 k&auml;ytt&auml;&auml; Glasticia eli lasia muistuttavaa muovia mik&auml; yli
      1000&euro; puhelimessa on ainakin kyseenalaista. Samsung ei kertonut miksi t&auml;mm&ouml;inen 
      p&auml;&auml;t&ouml;s on tehty.</p>
      <br>
<p>Kameraj&auml;rjestelm&auml;t muutenkin matkivat S20-sarjaa. Note20 Ultra on varustettu S20 
    Ultrasta tuttua 108MP P&auml;&auml;kameralla ja 12Mp ultralaajakameralla. Telekamera on 
    vaihdettu 12MP sensoriin ja suureen 5X optiseen zoomiin. Note20 on l&auml;helle s20 ja s20+ 
    ja Note20 tarjoaa 12MP p&auml;&auml;kameran, 64MP telekameran 3x Hybridi Zoomilla sek&auml; 
    12MP Ultralaajakameran.</p>
    <br>
<p>Suomessa Prosessorina molemmissa versioissa on Exynos 990, miss&auml; on tuki 5G-verkoille. 
    Note20 mallissa on 8GB LPDDR-muistia ja 256GB tallennustilaa. Ultra-mallissa Ramia on 12GB 
    ja tallennustilaa 256-512GB. Akkua on Note20 4300 mAh ja Note20 Ultrassa 4500 mAh. Molemmissa malleissa on tuki 25w pikalataukselle ja 15w langattomalle pikalataukselle.</p>
<br>
<p>Samsung Galaxy Note20-mallin ennakkomyynti alkaa Suomessa heti ja kauppoihin 21. elokuuta.
     Note20 tulle 256GB tallennustilalla ja 8GB ramilla 1099&euro; hintaan v&auml;rein&auml; Mystic Bronze, Mystic Grey ja Mystic Green. Note20 Ultra tullee kahdessa eri v&auml;rivaihtoehtona Mystic Black ja Mystic Bronze. 512GB versio 1449&euro; hinnalla.</p>
</center>
<center>
<img src="Note20 toka.webp">
</center>

<h6 style="text-align: center;">Kirjoittanut: Alex Ruuska 6.8.2020 p&auml;ivitetty: -</h1>


    <center>
    <h6>
    (c) copyright MA-Technology
    </h6>
    </center>




</script>
</body>
</html>